Repository: codeispoetry/sharepicgenerator3
Catalog: httpdocs/languages/*.po
Languages: de

source: Sharepicgenerator is a free service that allows you to create images with text for social media. You can use it to create images for Facebook, X, Instagram, LinkedIn, and other social networks. You can also use it to create images for your blog posts, Facebook ads, and more.
de: Sharepicgenerator ist ein kostenloser Dienst, mit dem du Bilder mit Text für soziale Medien erstellen kannst. Du kannst ihn verwenden, um Bilder für Facebook, X, Instagram, LinkedIn und andere soziale Netzwerke zu erstellen. Du kannst ihn auch verwenden, um Bilder für deine Blog-Beiträge, Facebook-Anzeigen und mehr zu erstellen.

source: Login
de: Einloggen

source: Not registered yet?
de: Noch nicht registriert?

source: Register
de: Registrierung

source: Forgot password?
de: Passwort vergessen?

source: login with Green Net
de: Mit Grünem Netz einloggen

source: Already registered?
de: Bereits registriert?

source: Password reset
de: Passwort zurücksetzen

source: search in image database
de: Suche in Bilddatenbank

source: Single click on an image sets the image as background, double click sets image and closes results.
de: Ein Klick setzt das Bild als Hintergrund, ein <strong>Doppelklick</strong> setzt das Bild und <strong>schließt die Ergebnisse</strong>.

source: Elements
de: Elemente

source: Add element
de: Element hinzufügen

source: Size
de: Größe

source: Eyecatcher
de: Störer

source: Add eyecatcher
de: Störer hinzufügen

source: Rotation
de: Drehung

source: Circle
de: Kreis

source: Square
de: Quadrat

source: Rect 16:9
de: Rechteck 16:9

source: Design settings
de: Design-Einstellungen

source: Please select a color and add it to the palette.
de: Farbe auswählen und zur Palette hinzufügen.

source: Add color
de: Farbe hinzufügen

source: Select a color and add it to the palette.
de: Wähle mit der Pipette Farben aus.

source: To remove a color, click on the color in the palette.
de: Wenn du mit dem Mauszeiger über eine Farbe gehst, erscheint ein Löschen-Symbol. So kannst du die Farbe wieder entfernen.

source: Remove color
de: Farbe entfernen

source: Add text
de: Text hinzufügen

source: Total size
de: Gesamtgröße

source: Font
de: Schrift

source: toggle capitalization
de: Groß- /Kleinbuchstaben umschalten

source: toggle alignment
de: links oder zentriert

source: toggle font family
de: Schriftart ändern

source: toggle style
de: Schriftstil ändern

source: Additional text
de: Zusatztext

source: Color
de: Farbe

source: Canvas
de: Leinwand

source: Change size
de: Größe ändern

source: Set dimensions manually
de: Größe manuell einstellen

source: Edit background image
de: Hintergrundbild bearbeiten

source: set image
de: Bild einstellen

source: Make image draggable
de: Bild verschiebbar machen

source: Image size
de: Bildgröße

source: fit automatically
de: automatisch einpassen

source: Brightness
de: Helligkeit

source: Saturate
de: Sättigung

source: Blur
de: Unschärfe

source: Copyright
de: Urheberrechts&shy;hinweis

source: Add copyright
de: Urheberrechts&shy;hinweis hinzufügen

source: The copyright is placed automatically from the database.
de: Der Urheberrechtshinweis wird automatisch mit dem Bild aus der Bilddatenbank eingefügt. Bei einem von Dir hochgeladenem Bild erscheint ein Platzhaltertext, den Du ändern kannst.

source: side left
de: seitlich links

source: bottom right
de: rechts unten

source: Delete background image
de: Hintergrundbild löschen

source: Edit form
de: Form bearbeiten

source: Guest
de: Gast

source: please choose
de: bitte wählen

source: Please edit the text directly in the image.
de: Bitte ändere Deinen Text direkt im Bild links.

source: Colors
de: Farben

source: Appearance
de: Aussehen

source: Line
de: Zeile

source: Colorset
de: Farbschema

source: Indent
de: Einrückung

source: Europe
de: Europa

source: Add "Do, what counts"
de: Europaclaim hinzufügen

source: Background image
de: Hintergrundbild

source: Foreground image or graphic
de: Vordergrundbild oder Form

source: Upload an image from your local computer
de: Eigenes Bild hochladen

source: Drop an image or choose it to upload from your computer
de: Drag and Drop oder wähle ein Bild zum Upload von deinem Computer aus

source: Image from database
de: Bild aus Datenbank

source: Choose an image database
de: Wähle eine Datenbank

source: search ...
de: Suche ...

source: Add from
de: Form hinzufügen

source: Choose a form and colorize later.
de: Wähle eine Form und färbe sie anschließend ein.

source: Create image with AI
de: Bild mit KI erstellen

source: Use artificial intelligence to create a unique image.
de: Nutzen Sie künstliche Intelligenz, um ein einzigartiges Bild zu erstellen.

source: Please keep in mind, that generated images may reproduce stereotypes or be inappropriate.
de: Bitte beachte, dass generierte Bilder Stereotypen reproduzieren oder unangemessen sein können.

source: Adjust your prompt accordingly.
de: Passe Deinen Prompt ggf. entsprechend an.

source: Describe the image you want
de: Beschreibe das Bild, das Du möchtest

source: Create
de: Erstellen

source: Please wait while AI generates your image.
de: Bitte warte, während die KI Dein Bild generiert.

source: This can take up to one minute.
de: Dies kann bis zu einer Minute dauern.

source: seconds
de: Sekunden

source: Result
de: Ergebnis

source: Use this image
de: Dieses Bild verwenden

source: Try again
de: Nochmal versuchen

source: Area
de: Grüne Fläche

source: Show green area
de: Grüne Fläche anzeigen

source: Close text editor
de: Textauswahl aufheben

source: Edit foreground image
de: Vordergrundbild bearbeiten

source: Image
de: Bild

source: round
de: rund

source: image as round
de: Bild als Kreis

source: angular
de: rechteckig

source: image as angular
de: Bild als Quadrat

source: Image original
de: Bild im Originalformat

source: text floats right
de: Text rechts

source: text below
de: Text darunter

source: Foreground image
de: Vordergrundbild

source: Hello
de: Hallo

source: You have successfully registered. Please click on the following link to confirm your registration:
de: Du hast dich erfolgreich registriert. Bitte klicke auf den folgenden Link, um deine Registrierung zu bestätigen:

source: Click on the following link to reset your password:
de: Klicke auf den folgenden Link, um dein Passwort zurückzusetzen:

source: Latest sharepics
de: Neueste Sharepics

source: Usage Overview
de: Nutzung

source: %a days, %h hours, %i minutes
de: %a Tage, %h Stunden, %i Minuten

source: Logging since: %s
de: Geloggt wird: %s

source: Number of users: %s
de: Anzahl der Nutzer*innen: %s

source: Number of sharepics: %s
de: Anzahl der Sharepics: %s

source: Clicks on image after imagedb search: %s
de: Klicks auf ein Bild nach einer Bildersuche: %s

source: Number of tmp-files: %s
de: Anzahl der tmp-Dateien: %s

source: Usage Log
de: Nutzungs-Log

source: My colors
de: Meine Farben

source: Colors can be edited in settings %s.
de: Du kannst Deine Farben in den Design-Einstellungen %s anlegen.

source: username
de: Benutzer*innenname

source: password
de: Passwort

source: login
de: einloggen

source: password repeat
de: Passwort wiederholen

source: request reset link
de: Passwortlink anfordern

source: I have read the %sterms of condition%s and accept them.</a>
de: Ich habe die %sNutzungsbedingungen%s gelesen und akzeptiere sie.</a>

source: register
de: registrieren

source: close
de: schließen

source: Order
de: Anordnung

source: to front
de: nach vorn

source: to back
de: nach hinten

source: delete
de: löschen

source: Support
de: Hilfe

source: Imprint
de: Impressum

source: Privacy
de: Datenschutz

source: File
de: Datei

source: New
de: Neu

source: Save as
de: Zwischenspeichern

source: Open my templates
de: Meine Vorlagen öffnen

source: Bundestagswahl
de: Zwischengespeicherte Datei öffnen

source: German
de: Deutsch

source: English
de: Englisch

source: Logfile
de: Logdatei

source: Logout
de: Ausloggen

source: Create Sharepic
de: Erstelle ein Sharepic

source: My Sharepics
de: Meine Sharepics

source: Save
de: Zwischenpeichern

source: Help and FAQ
de: Hilfe und FAQ

source: Open saved sharepics
de: Zwischengespeicherte Datei öffnen

source: Create sharepics for your social media channels.
de: Erstelle Sharepics für Deine Social-Media-Kanäle.

source: login with Mint ID
de: Mit MINT.ID einloggen

source: Undo
de: Rückgängig

source: Download
de: Herunterladen

source: Front picture
de: Vordergrundbild

source: Graphics and foreground pictures
de: Grafiken & Vordergrundbilder

source: Main Text
de: Text

source: Add Text
de: Text hinzufügen

source: European Election
de: Europawahl

source: Settings
de: Einstellungen

source: Logged in as
de: Eingeloggt als

source: Please wait, while your sharepic is being created. This may take a few seconds.
de: Bitte warte, während Dein Sharepic erstellt wird. Dies kann einige Sekunden dauern.

source: Are you sure, that you want to delete your sharepic?
de: Bist Du sicher, dass du Dein gespeichertes Sharepic löschen möchtest?

source: Do you want to log out?
de: Möchtest Du Dich ausloggen?

source: Please save your sharepic. All changes will be lost.
de: Bitte speichere Dein Sharepic, ansonsten gehen alle Änderungen verloren.

source: Please enter a text describing your desired image.
de: Bitte ändere Deinen Text direkt im Bild links.

source: Maximum number of elements reached
de: Maximale Anzahl von Elementen erreicht

source: Uploading your image ...
de: Das Bild wird hochladen ...

source: Your image is being processed ...
de: Dein Bild wird vorbereitet ...

source: The image is too big. Max. 15 MB are allowed.
de: Das Bild ist zu groß. Es sind maximal 15 MB erlaubt.

source: You have automatically been logged out. Please reload the page and log in again.
de: Du wurdest automatisch ausgeloggt. Bitte lade die Seite neu, um Dich erneut einzuloggen.

source: You will be automatically logged out soon. Please either save your work or download it and reload the page.
de: Du wirst in Kürze automatisch ausgeloggt. Bitte speichere Deine Arbeit oder lade sie herunter und lade die Seite neu.

source: Please wait until the image is uploaded.
de: Bitte warte, bis das Bild hochgeladen ist.

source: Maximum number of lines reached. For longer text, please use additional text element.
de: Die maximale Anzahl von Zeilen wurde erreicht. Für längeren Text nutze bitte das zusätzliche Textelement.

source: Color added
de: Farbe hinzugefügt

source: Please choose a new color first
de: Bitte wähle zunächst eine neue Farbe

source: One moment please
de: Augenblick bitte

source: Create sharepics for your social media channels in the layout of the German Green Party.
de: Erstelle Sharepics für Deine Social-Media-Kanäle im Layout der Grünen.

source: back
de: zurück

source: color
de: Farbe

source: Shadow
de: Schatten

source: font size
de: Schriftgröße

source: font appearance
de: Schrift

source: font
de: Schriftart

source: clear format
de: Formatierung löschen

source: show source
de: Quelltext

source: show richt text editor
de: Rich Text Editor
